{"rooms":
[
  {
	"id":"chatsubo",
  	"background":"chatsubo",
  	"conversations":
  	[
		{
			"tag":"longdescription",
			"message":"You've just spent the night sleeping face-down in a pile of synth-spaghetti in a bar called Chatsubo. After rubbint the sauce out of your eyes, you can see Chiba sky through the window, the color of television tuned to a dead channel.\nA PAX booth is on the wall. Ratz's prosthetic Russin arm whines as he wipes the bar. His teeth are a webwork of East Eurpoean steel and brown decay.",
			"set":"chatsubo=0|_trigger=talk"
		},
		{
			"tag":"description",
			"message":"In the Chatsubo bar"
		},
  		{
  			"condition":"chatsubo=0",
  			"lines":
  			[
  				"I don't care if you eat that spaghetti or sleep in it, you still gotta pay for it. 46 credits."
  			],
			"set":"chatsubo=1|_trigger=talk"
  		},
  		{
  			"condition":"chatsubo=1",
  			"options":
  			[
  				{ "line":"Sorry, Ratz. I can't afford it. Want me to give it back?", "response":"Pay up, cyberscum. Use the PAX if you need money." },
  				{ "line":"How about if I owe it to you? You can trust me.", "response":"Pay up, cyberscum. Use the PAX if you need money." },
  				{ "line":"I'm ready for dessert. Have you got any pudding for me to sleep in?", "response":"Pay up, cyberscum. Use the PAX if you need money." },
  				{ "line":"I'd like to sleep on it some more, if that's okay with you, Ratz.", "response":"You been sleepin' in that stuff all night. Now pay up or I call a lawbot." }
  			]
  		},
  		{
			"condition":"chatsubo=1",
  			"action":"receive<$46",
			"message":"Ratz refuses to take your credits.",
  			"lines":
  			[
  				"I said 46 credits, buckwheat. Are you deaf?"
  			],
			"set":"_inventory=@receive@"
  		},
  		{
			"condition":"chatsubo=1",
  			"action":"receive>$45",
  			"lines":
  			[
  				"Thanks, friend artiste. Shin came by, but he didn't want to interrupt your beauty sleep. He still has your deck."
  			],
  			"set":"chatsubo=2|_trigger=talk"
  		},
  		{
  			"condition":"chatsubo=2",
  			"options":
  			[
  				{ "line":"What deck does Shin have?", "response":"Your Yamamitsu UXB, Herr %name%. Shin says you pawned it at his shop." },
  				{ "line":"Anything else come up?", "response":"One of Lonny Zone's girls was looking for you too. You got biz with Zone?", "set":"chatsubo=3" },
  				{ "line":"Who you calling an artiste?", "response":"You are the artiste of the slighly funny deal, Herr %name%." }
  			]
  		},
  		{
  			"condition":"chatsubo=3",
  			"options":
  			[
  				{ "line":"Zone's a close friend of mine. Did I hear something about the Health Department closing this place?", "response":"A minor problem, friend artiste. I'll be back in business within the week." },
  				{ "line":"Anything else you want to tell me?", "response":"Better find a way to pay your bill at Cheap Hotel, or they'll start asking you to sell yout body parts.", "set":"chatsubo=4" }
  			]
  		},
  		{
  			"condition":"chatsubo=4",
  			"options":
  			[
  				{ "line":"So I sell a kidney or two. Why don't you get off my case, Ratz?", "response":"You should have fear, artiste. It may be your friend. Now get out of here before the lawbot arrives.", "set":"chatsubo=5" },
  				{ "line":"That's it. I'm leaving.", "response":"Good luck, artiste. You're going to need it.", "set":"chatsubo=5" }
  			]
  		}
  	] 
  }
],
"strings":
{
	"paxfirsttime":"PAX, the Public Access System, was first implemented as a result of the Gibson Mandate of 2036. PAX allows general access to the Central Database Interlink (CDI) with Friendly Interface System Hardware (FISH) designed for Limited Free Access (LFA) to the Multi-Phased Public Information Library Core (MPPILC) in conjunction with the Swiss Orbital Banking (SOB) network, which is regulated by the Chiba City Public Database Regulating Agency (CCPDRA) in concordance with the World Holographic Organizational Obligation for Electronic Eavesdropped (WHOOPEE) Guidlines established by the Balfour Act. With the institution of WHOOPEE protocol, LFA became possible with the MPPILC system and the SOB network. The FISH, contained within the PAX Booth, was ergonomically designed for Optimal Ease of Use (OEU) within the specifications of the agencies involved, primarily CCPDRA and the SOB network. OEU makes operation of the PAX system a simple task for both the First Time User (FTU) and the Experienced Adept (EA) through implementation of menus and Simple Directions (SD) available in Lucid Help Files (LHF) such as this one, in which Simplified Grammatical Syntax (SGS) and Simple Word Choice (SWC) algorithms have been employed to benefit User Understanding (UU).",
	"irsnotice":"IRS Field Supervisors:\n\nField Supervisors should warn IRS Field Examiners under their command that use of the garrote, the Rack, and the Iron Maien by Examiners is unwarranted under most Taxpayer Compliance Program cases. The rubber hose and the insertion of bamboo under the fingernails should be sufficient for Taxpayer compliance in most situations where motivation is required. Use of stronger forms of interrogation by Field Examiners is frowned upon, unless a Field Supervisor qualified in Interrogation is , or the Field Examiner is performing a Special Field Audit. Due to the high number of Taxpayer requests for current information, possibly due to the Public's inability to remain current with the hourly changes in the Tax Code, the IRS Administration has approved the activation of a question-and-answer bulletin board service on this system. The real purpose of this service is to locate and arrest tax offenders who have otherwise managed to be overlooked by our standard procedues. So far, results have been excellent. In two weeks of operation, over four thousand tax offenders have been arrested and sentenced.",
	"irsaudit":"No report at this time."
},
"news":
[
	{
		"date":111658,
		"title":"BAR FOOD DECLARED FATAL",
		"message":"BAR FOOD DECLARED FATAL\nThe Chatsubo bar will be permanentoy closed today, according to the Chiba Health Department. Contaminated food and toxic beer are the main reasons for the closure, although there have been other health violations. So far, 87 fatalities have been reported in connection with this investigation.\n\nMost of the fatalities occurred with Chatsubo patrons who drank more than 3 glasses of beer and ate the synth-spaghetti, which is based on a home recipe. The spaghetti and beer combined in the bodies of the victims to create an explosive chemical which was ignited by stomach acids."
	},
	{
		"date":111658,
		"title":"COWBOY DISAPPEARS",
		"message":"COWBOY DISAPPEARS\nRumors are flying among the elite cyberspace cowboy community. Well-known logic gate crasher, Jonathan E, has mysteriously vanished, causing speculation that he was killed in cyberspace by \"black ice,\" an illegal form of base protection."
	},
	{
		"date":111658,
		"title":"News In Brief",
		"message":"**** News In Brief ****\n\nFARM ANIMALS KIDNAP UFO\nSheep says, \"We were just hoyriding!\"\nMAN EATS HIS OWN HEAD\n\"He thought it was just a donut,\"says the owner of Donut World, where the incident occurred.\n\nSON OF FUJI PREZ MISSING\nMother wails, \"He's gone!\" Prez of Fuji Electric denies any connection with rumored corporate takeover."
	},
	{
		"date":111758,
		"title":"NASA AND FUJI DO BUSINESS",
		"message":"NASA AND FUJI DO BUSINESS\nAnticipating increased space activity, NASA has signed a multi-million dollar contract with Fuji Electric to provide ROMcards for future spacecraft. Fuji President Harry Watkins, recently in the news when his son was kidnapped, said, \"This is great. I'm thrilled.\" Watkins expects to be hiring hundreds of new employees as a result of the contract."
	},
	{
		"date":111758,
		"title":"News In Brief",
		"message":"**** News In Brief ****\n\nSAVAGE NIGHT OF TORTURE\nStrange Chatsubo patron spends night sleeping in synth-spaghetti. Customers shocked.\n\nSON RETURNED TO FUJI PREZ\nChoked with emotion, Fuji Prez says, \"We must have misplaced him.\" As to his son's condition, the Prez reports, \"He's in one piece, more or less.\""
	},
	{
		"condition":"justice>0",
		"date":110058,
		"title":"CRIMINAL HITS CHIBA CITY",
		"message":"CRIMINAL HITS CHIBA CITY\n%name%, a notorious criminal who recently arrived in Chiba City, has been arrested and taken to the Justice Booth. This comes as no surprise to police, who have been watching this criminal ever since he arrived. \"We knew he'd break the law eventually,\" said Officer Watanabe. \"These habitual criminals can't go a whole day without committing a crime.\""
	},
	{
		"condition":"hotel>100",
		"date":110058,
		"title":"VAGRANT PAYS HOTEL BILL",
		"message":"VAGRANT PAYS HOTEL BILL\nPaul Stack, owner of Cheap Hotel, called a news conference this morning to report that Cowboy %name% has finally paid his hotel bill. Stack is referring to this payment as \"a momentous event in my life. Being the kind-hearted kind of guy that I am, I let that blll accumulate far too long before demanding payment. Imagine my surprise when the scum finally paid it. I was ready to call the Tactical Police.\""
	},
	{
		"condition":"chatsubo>1",
		"date":110058,
		"title":"CHATSUBO DEBT",
		"message":"Thisis a story that will appear when chatsubo is paid off but not before."
	}
],
"allmessages":
{
	"board":
	{
		"messages":
		[
			{
				"date":111458,
				"to":"All",
				"from":"sysop",
				"message":"Due to a lighting strike on the PAX building, all BBS messages on the system before 11/14/58 were trashed. Sorry for the inconvenience."
			},
			{
				"date":111458,
				"to":"%name%",
				"from":"Matt Shaw",
				"message":"Take some advice, man. There's a lot of good software showing up on the BBS's. You'll need it to figure out what's going on, so find as much as you can. Upgrade your Comlink warez and your equipment so you can reach the better bases. When you're ready, and you've got enough money together, find us in cyberspace. We need your help bad, but I can't talk about it here. Don't want to start a panic, know what I mean?"
			},
			{
				"date":111458,
				"to":"%name%",
				"from":"FFargo",
				"message":"You still own me 2000 credits. Will I have to sell your lungs to get it?"
			},
			{
				"date":111458,
				"to":"%name%",
				"from":"Shin",
				"message":"Better pick up your deck at my pawn shop, otherwise I'll have to sell it."
			},
			{
				"date":111458,
				"to":"%name%",
				"from":"Crazy Edo",
				"message":"Where's my caviar? I said I'd trade you some software for it, remember?"
			},
			{
				"date":111558,
				"to":"%name%",
				"from":"Matt Shaw",
				"message":"Since you've been out of touch for a while, and since you're an old friend, I thought I'd help you out with some comlink numbers to get you started. Use them as soon as you get your deck back (yeah, I heard you had to pawn it). The link codes are : CHEAPO for Cheap Hotel, REGFELLOW for the Regular Fellows, CONSUMEREV for Consumer Review, ASANOCOMP for Asano Computing, WORLDCHESS for the World Chess Confederation. These ought to help keep you busy until you can afford a cyberspace-capable deck."
			},
			{
				"date":111558,
				"to":"%name%",
				"from":"Bosch",
				"message":"Remember your old pal Anonymous Bosch? Remember how I borrowed your Cryptology skill chip siz month ago and forgot to give it back? Well, I dropped it off with Shive at the Gentleman Loser for you to pick up. Thanks. Sorry I took so long."
			},
			{
				"date":111658,
				"to":"%name%",
				"from":"Emp. Norton",
				"message":"Heard you were in town and thought you ought to know something weird's going on in cyberspace. Sharpen your skills and keep your head down."
			},
			{
				"date":111658,
				"to":"Ratz",
				"from":"Red Snake",
				"message":"Read about your problem in the Night City News. Did you forget to pay off the Health Department this month? I can fix it. Talk to me."
			},
			{
				"date":111658,
				"to":"Ratz",
				"from":"Interplay",
				"message":"CREDITS HERE"
			},
			{
				"date":111658,
				"to":"All",
				"from":"Armitage",
				"message":"We're looking for a few good cowboys. Seeking adventure? Like money? Like living on the razor's edge? Good with a cyberspace deck? Simply by answering this ad with your BAMA id number, you can earn instant money and learn about an exciting opportunity."
			},
			{
				"date":111658,
				"to":"All",
				"from":"Hitachi",
				"message":"Need some quick cash? Come and see us at Hitachi Biotech in the high-tech zone of Chiba City. We need volunteers for a simple experiment that won't require much of your time."
			},
			{
				"date":111758,
				"to":"%name%",
				"from":"Emp. Norton",
				"message":"Shiva at the Gentleman Loser has a Matrix Restaurant guest pass for you. Let's talk."
			},
			{
				"date":111758,
				"to":"All",
				"from":"CFM",
				"message":"Are you angry about being locked out of cyberspace just because special equipment is required? Does it bug you that thousands of common workers have access to cyberspace every day? Why can't the general public have access to cyberspace information? We're angry too. Contact us for more information at link code FREEMATRIX. The password for those who are non-members is CFM. Fight back and get what's coming to you!"
			},
			{
				"date":111758,
				"to":"All",
				"from":"IRS",
				"message":"Got a problem with your taxes? Are the hourly tax law changes to hard to keep up with? Give us a call. We've set up a new Tax Information service that allows you, John Q. Taxpayer, to ask us, the Internal Revenu Service, for anwers to your difficult questions.\nThe comlnk number is IRS (that ought to be easy enough to remember), and the password is TAXINFO. Remember the last word in our ame is Service!"
			},
			{
				"date":110058,
				"condition":"mail_armitage=1",
				"to":"%name%",
				"from":"Armitage",
				"message":"Thanks for your response to my ad. The amount of $10,000 has been deposited to your bank account. Please meet me, General Armitage, in the street directly outside the Matrix Restaurant as soon as possible."
			}
		]
	},
	"irs":
	{
		"messages":
		[
			{
				"date":111658,
				"to":"IRS",
				"longto":"--",
				"from":"L. Zone",
				"headers":"BAMA ID: 1404726431",
				"message":"I had twenty million credits worth of incoming this year in my black market pituitary extract operation. This is my first year in business. Which forms should I use to report this income? Can my business startup expenses be deducted?"
			},
			{
				"date":111658,
				"to":"L. Zone",
				"from":"IRS",
				"longfrom":"--",
				"message":"Your business is an illegal operation. We have identified you to the proper law encorcement agencies. Pending further investigation, your total incoming for theyear has been turned over to us."
			},
			{
				"date":111658,
				"to":"IRS",
				"longto":"--",
				"from":"R. Hammer",
				"longfrom":"Rafaella Hammer",
				"headers":"BAMA ID: 2776081129",
				"message":"Due to an oversight on the part of my accountant, I failed to report all of my income for the last year. What form should I file to correct this oversight and how much of a penalty will I have to pay?"
			},
			{
				"date":111658,
				"to":"R. Hammer",
				"longto":"Rafaella Hammer",
				"from":"IRS",
				"longfrom":"--",
				"message":"We have given your case careful consideration and have decided that there will be no penalty incurred on the income you failed to report last year. However, you and your tax accountant are you going to jail."
			}
		]
	}
},
"items":
{
	"1" : { "name":"pawn ticket", "type":"misc" },
	"2" : { "name":"UXB", "type":"deck" }
},
"software":
{
	"1" : { "name":"ComLink", "type":"comlink", "version":2 }
},
"sites":
{
	"irs":
	{
		"passwords":["taxinfo", "audit", "_cyberspace"],
		"comlinklevel":1,
		"title":"** Internal Revenue Service **",
		"pages":
		{
			"initial" :
			{
				"type":"menu",
				"menuentries":
				[
					{ "name":"Exit System", "key":"x", "dest":"exit" },
					{ "name":"TaxInfo Board", "key":"1", "dest":"irsboard" },
					{ "name":"Supervisor's Notice", "key":"2", "dest":"notice", "condition":"level=2" },
					{ "name":"Special Audit Report", "key":"3", "dest":"auditreport", "condition":"level=2" },
					{ "name":"View Audit List", "key":"4", "dest":"auditlist", "condition":"level=2" }
				]
			},
			"irsboard" :
			{
				"type":"messages",
				"messagesid":"irs",
				"exit":"initial"
			},
			"notice" :
			{
				"type":"message",
				"exit":"initial",
				"stringid":"irsnotice"
			},
			"auditreport" :
			{
				"type":"message",
				"exit":"initial",
				"stringid":"irsaudit"
			},
			"auditlist" :
			{
				"type":"list",
				"exit":"initial",
				"header":"Field Audit List",
				"columns":["Name", "BAMA ID"],
				"listentries":
				[
					{ "fields":["%name%", "%bamaid%"], "details":"Reason: Tax evasion." },
					{ "fields":["FINDLEY MATTHEW", "001131968"], "details":"Reason: Tax evasion." },
					{ "fields":["CHUNG LO DUC", "471294819"], "details":"Reason: Tax evasion." },
					{ "fields":["NAKASONE SANDRA", "255885697"], "details":"Reason: Tax evasion." },
					{ "fields":["MARTINEZ RAUL", "549887110"], "details":"Reason: Tax evasion." }
				]
			}
		}
	},
	"cheapo":
	{
		"passwords":[""]
	}
},
"mailserver":
{
	"armitage":
	{
		"%bamaid%":"_deposit=10000|mail_armitage=1"
	}
}
}

